benchmark-suite/10-13-2025/benchmark_serving.txt
INFO 10-13 18:44:21 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7c15eab95090>, seed=0, num_prompts=1024, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=32, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', endpoint_type=None, base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='/data/Meta-Llama-3-8B-Instruct/', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 10-13 18:44:24 [datasets.py:507] Sampling input_len from [31, 31] and output_len from [512, 512]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:07 elapsed, 1320:59:50 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 1024/1024 [01:03<00:00, 16.16it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1006      
Benchmark duration (s):                  63.36     
Total input tokens:                      31165     
Total generated tokens:                  292799    
Request throughput (req/s):              15.88     
Output token throughput (tok/s):         4621.03   
Peak output token throughput (tok/s):    7680.00   
Peak concurrent requests:                1006.00   
Total Token throughput (tok/s):          5112.89   
---------------Time to First Token----------------
Mean TTFT (ms):                          22434.13  
Median TTFT (ms):                        21960.26  
P99 TTFT (ms):                           50501.78  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          46.85     
Median TPOT (ms):                        48.49     
P99 TPOT (ms):                           54.22     
---------------Inter-token Latency----------------
Mean ITL (ms):                           46.39     
Median ITL (ms):                         40.05     
P99 ITL (ms):                            78.06     
==================================================